Emacs.org
#+title: Emacs Configuration
#+author: jdlugosz963
#+PROPERTY: header-args:emacs-lisp :tangle .config/emacs/init.el

* Table of contents :toc:
- [[#startup-performance][Startup Performance]]
- [[#user-information-setup][User information setup]]
- [[#stay-clean][Stay clean]]
- [[#package-setup][Package setup]]
- [[#update-path][Update Path]]
- [[#keboard-setup][Keboard Setup]]
  - [[#general-setup][General Setup]]
  - [[#evil-mode-setup][Evil mode setup]]
- [[#ui-configuration][UI Configuration]]
  - [[#basic-ui-setup][Basic UI setup]]
  - [[#ivy-and-counsel][Ivy and Counsel]]
  - [[#which-key][Which key]]
  - [[#modline][Modline]]
  - [[#hydra][Hydra]]
  - [[#beacon][Beacon]]
  - [[#other-keybindings][Other Keybindings]]
- [[#org][Org]]
  - [[#org-mode-setup][Org-mode setup]]
  - [[#org-evil][Org evil]]
  - [[#org-make-toc][Org make toc]]
  - [[#org-fonts][Org fonts]]
  - [[#org-tempo-setup][Org tempo setup]]
  - [[#org-babel-setup][Org babel setup]]
  - [[#org-margin][Org margin]]
  - [[#org-superstar][Org superstar]]
  - [[#org-roam][Org roam]]
- [[#development][Development]]
  - [[#languages][Languages]]
  - [[#dap-mode][Dap mode]]
  - [[#company][Company]]
  - [[#projectile][Projectile]]
  - [[#neotree][Neotree]]
  - [[#magit][Magit]]
- [[#apps][Apps]]
  - [[#vterm][Vterm]]
  - [[#dired][Dired]]
  - [[#emms][EMMS]]
  - [[#pdf-tools][PDF Tools]]
  - [[#mu4e][Mu4e]]
  - [[#rss][RSS]]
- [[#runtime-performance][Runtime Performance]]

* Startup Performance

#+begin_src emacs-lisp

  (setq gc-cons-threshold (* 50 1000 1000))

  (defun jd/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                       (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'jd/display-startup-time)

#+end_src

* User information setup

#+begin_src emacs-lisp

  (setq user-full-name "Jakub Dlugosz"
        user-mail-address "jdlugosz963@gmail.com") 

#+end_src

* Stay clean

#+begin_src emacs-lisp

  (setq backup-directory-alist '(("." . "~/.cache/emacs/backup"))
        backup-by-copying t
        version-control t
        delete-old-versions t
        kept-new-versions 20
        kept-old-versions 5)

  (setq user-emacs-directory "~/.cache/emacs")

#+end_src

* Package setup

#+begin_src emacs-lisp

  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("gnu-devel" . "https://elpa.gnu.org/devel/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)

  (unless package-archive-contents
    (package-refresh-contents))

  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (setq use-package-always-ensure t)

  (require 'use-package)

#+end_src

* Update Path

#+begin_src emacs-lisp
  (push ".config/emacs/jd/" load-path)
#+end_src

* Keboard Setup
** General Setup

#+begin_src emacs-lisp

  (use-package general
    :config
    (general-create-definer jd/leader-key-def
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (general-create-definer jd/ctrl-c-keys
      :prefix "C-c"))

#+end_src

** Evil mode setup

#+begin_src emacs-lisp

  (use-package undo-tree
    :diminish
    :config
    (setq undo-tree-auto-save-history nil)
    (global-undo-tree-mode 1))

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-Y-yank-to-eol t) 
    (setq evil-want-C-i-jump nil) 
    (setq evil-undo-system 'undo-tree)
    (setq evil-kill-on-visual-paste nil)
    :config
    (evil-set-initial-state 'exwm-mode 'emacs)
    (evil-mode 1))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

*** Keybinds

#+begin_src emacs-lisp

  (defhydra hydra-resize-window (:timeout 4)
    ("h" evil-window-decrease-width "<")
    ("l" evil-window-increase-width ">")
    ("k" evil-window-decrease-height "^")
    ("j" evil-window-increase-height "v")
    ("q" nil "finished" :exit t))

  (jd/leader-key-def
    "w"  'evil-window-map
    "wr" '(hydra-resize-window/body :which-key "Rezize window")
    "wd" '(evil-window-delete :which-key "Window delete"))

  (jd/leader-key-def
    "ou" '(undo-tree-visualize :which-key "Open"))

  ;; remove . key
  (define-key evil-normal-state-map (kbd ".") '())
#+end_src

* UI Configuration
** Basic UI setup
#+begin_src emacs-lisp

  (setq inhibit-startup-message t)
  (setq visible-bell t)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (menu-bar-mode -1)
  (set-fringe-mode 10)

  (set-face-attribute 'default nil :font "Hack" :height 100)

  (add-hook 'prog-mode-hook 'menu-bar--display-line-numbers-mode-relative)

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (defalias 'yes-or-no-p 'y-or-n-p)

  (use-package doom-themes
    :config
    (load-theme 'doom-badger t))

  (use-package diminish)

#+end_src

**
#+begin_src emacs-lisp

  (use-package hl-todo
    :init
    (setq hl-todo-keyword-faces
          '(("TODO"   . "#FF0000")
            ("FIXME"  . "#FF0000")
            ("DEBUG"  . "#A020F0")))
    :config
    (global-hl-todo-mode 1))

#+end_src
** Ivy and Counsel

#+begin_src emacs-lisp

      (defun jd/switch-buffer ()
        (interactive)
        (let ((completion-regexp-list '("\\`[^*]"
                                        "\\`\\([^T]\\|T\\($\\|[^A]\\|A\\($\\|[^G]\\|G\\($\\|[^S]\\|S.\\)\\)\\)\\).*")))
          (call-interactively 'counsel-switch-buffer)))

      (use-package ivy
        :diminish
        :bind
        (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("C-k" . ivy-previous-line)
         ("C-j" . ivy-next-line)
         :map ivy-switch-buffer-map
        ("C-k" . ivy-previous-line))
        :config
        (ivy-mode 1))

      (use-package counsel
        :config
        (counsel-mode 1))

#+end_src

*** Keybinds

#+begin_src emacs-lisp

  (jd/leader-key-def
    "t"  '(:ignore t :which-key "Toogle")
    "tt" '(counsel-load-theme :which-key "Choose theme"))

  (jd/leader-key-def
    "bb" '(jd/switch-buffer :which-key "Buffer switch")
    "ba" '(counsel-switch-buffer :which-key "Buffer switch")
    "b"  '(:ignore t :which-key "Buffer")
    "," '(counsel-switch-buffer :which-key "Buffer switch"))

#+end_src

** Which key

#+begin_src emacs-lisp

  (use-package which-key
    :diminish
    :config
    (which-key-mode)
    (setq which-key-idle-delay 0.3))

#+end_src

** Modline

#+begin_src emacs-lisp

  (use-package all-the-icons)

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))

#+end_src

** Hydra

#+begin_src emacs-lisp

  (use-package hydra
    :defer t)

  (defun jd/text-scale-increase ()
    (interactive)
    (let ((old-face-attribute (face-attribute 'default :height)))
      (set-face-attribute 'default nil :height (+ old-face-attribute 10))))

  (defun jd/text-scale-decrease ()
    (interactive)
    (let ((old-face-attribute (face-attribute 'default :height)))
      (set-face-attribute 'default nil :height (- old-face-attribute 10))))

  (defhydra hydra-text-scale-global (:timeout 4)
    "scale text"
    ("j" jd/text-scale-increase "in")
    ("k" jd/text-scale-decrease "out")
    ("q" nil "finished" :exit t))

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("q" nil "finished" :exit t))

  (jd/leader-key-def
    "tS" '(hydra-text-scale-global/body :which-key "Scale text")
    "ts" '(hydra-text-scale/body :which-key "Scale text"))

#+end_src

** Beacon 

#+begin_src emacs-lisp

  (use-package beacon
    :config
    (beacon-mode 1))

#+end_src

** Other Keybindings
*** Files

#+begin_src emacs-lisp

  (jd/leader-key-def
    "f"  '(:ignore t :which-key "Files")
    "fs" '(save-buffer :which-key "File save")
    "." '(find-file :which-key "Find file")
    "ff" '(find-file :which-key "Find file"))

#+end_src

*** Eval

#+begin_src emacs-lisp 

  (jd/leader-key-def
    "e"   '(:ignore t :which-key "Eval")
    "eb"  '(eval-buffer :which-key "Eval buffer"))

  (jd/leader-key-def
    :keymaps '(visual)
    "er" '(eval-region :which-key "Eval region"))

#+end_src

*** Buffers

#+begin_src emacs-lisp

  (defun jd/kill-other-buffers () 
    (interactive)                                                                   
    (mapc 'kill-buffer (cdr (buffer-list (current-buffer)))))

  (jd/leader-key-def
    "bK" '(jd/kill-other-buffers :which-key "Kill other buffers")
    "bk" '(kill-current-buffer :which-key "Kill buffer")
    "bB" '(ibuffer :which-key "Open ibuffer"))

#+end_src

* Org

** Org-mode setup

#+begin_src emacs-lisp

  (defun jd/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :hook (org-mode . jd/org-mode-setup)
    :config
    (setq org-directory (file-truename "~/Documents/org/"))
    (setq org-mobile-inbox-for-pull (concat org-directory "flagged.org"))
    (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
    (setq org-agenda-files
          '("Tasks.org"))
    (setq org-ellipsis " ▾")
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-return-follows-link t)
    (setq org-capture-templates
          `(("t" "Tasks / Projects")
            ("tt" "Task" entry (file+olp "Tasks.org" "Inbox")
             "* TODO %?\n  %t\n  %a\n  %i" :empty-lines 1)
            ("tT" "Task for tomorow" entry (file+olp "Tasks.org" "Inbox")
             "* TODO %?\n %t\n  SCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+1d\"))\n %a\n %i" :empty-lines 1)

            ("m" "Metrics Capture")
            ("mm" "Metrics" table-line (file+headline "Metrics.org" "Metrics")
             "| %U | %^{Weight} | %^{Waist} | %^{Notes} |" :kill-buffer t)))

    (setq org-latex-listings 'minted
          org-latex-packages-alist '(("" "minted"))
          org-latex-pdf-process
          '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
            "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

    (require 'org-tempo))

#+end_src

*** Keybinds

#+begin_src emacs-lisp

  (jd/leader-key-def
    "o" '(:ignore t :which-key "Open/Org")
    "oc" '(org-capture :which-key "Open org-capture")
    "oop" '(org-mobile-pull :which-key "Org mobile pull")
    "ooP" '(org-mobile-push :which-key "Org mobile push")
    "oa" '(org-agenda :which-key "Open org-agenda"))

#+end_src

