Emacs.org
** Org evil

#+begin_src emacs-lisp

  (use-package evil-org
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

#+end_src

** Org make toc

#+begin_src emacs-lisp

  (use-package toc-org
    :config
    (add-hook 'org-mode-hook 'toc-org-mode))

#+end_src

** Org fonts

#+begin_src emacs-lisp

  (defun jd/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•-"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.3)
                    (org-level-2 . 1.2)
                    (org-level-3 . 1.1)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Monospace" :weight 'Bold :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :font "mononoki Nerd Font" :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

  (with-eval-after-load 'org-faces (jd/org-font-setup))

#+end_src

** Org tempo setup

#+begin_src emacs-lisp

  (defun jd/org-tempo-setup ()
    (add-to-list 'org-structure-template-alist '("s" . "src"))
    (add-to-list 'org-structure-template-alist '("sql" . "src sql"))
    (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("li" . "src lisp"))
    (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
    (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("go" . "src go"))
    (add-to-list 'org-structure-template-alist '("yaml" . "src yaml")))

  (with-eval-after-load 'org-tempo (jd/org-tempo-setup))

#+end_src

** Org babel setup

*** Load languages

#+begin_src emacs-lisp

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

#+end_src

*** Auto tangle

#+begin_src emacs-lisp

  (defun jd/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name "~/dotfiles/"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'jd/org-babel-tangle-config)))

#+end_src

** Org margin

#+begin_src emacs-lisp

  (defun jd/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . jd/org-mode-visual-fill))

#+end_src

** Org superstar

#+begin_src emacs-lisp

  (use-package org-superstar
    :hook (org-mode . org-superstar-mode)
    :init
    (setq org-superstar-special-todo-items t)
    (setq org-superstar-remove-leading-stars t)
    (setq org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

** Org roam

#+begin_src emacs-lisp

  (defun jd/org-roam-filter-by-tag (tag-name)
    (lambda (node)
      (member tag-name (org-roam-node-tags node))))

  (defun jd/org-roam-list-notes-by-tag (tag-name)
    (mapcar #'org-roam-node-file
            (seq-filter
             (jd/org-roam-filter-by-tag tag-name)
             (org-roam-node-list))))

  (defun jd/org-roam-refreshagenda-list ()
    (interactive)
    (setq org-agenda-files (org-roam-list-files)))

  (use-package org-roam
    :custom
    (org-roam-directory (file-truename "~/Documents/org/roam/"))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n g" . org-roam-graph)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n c" . org-roam-capture)
           ;; Dailies
           ("C-c n j" . org-roam-dailies-capture-today))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    ;; If you're using a vertical completion framework, you might want a more informative completion interface
    (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    (org-roam-db-autosync-mode))

#+end_src

* Development
** Languages
*** Lsp

#+begin_src emacs-lisp

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-headerline-breadcrumb-enable nil)
    (setq lsp-diagnostics-provider :none)
    (setq lsp-modeline-diagnostics-enable nil)
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ivy
    :after lsp)

#+end_src

*** Python

#+begin_src emacs-lisp

  (defun jd/python-mode-setup ()
    (let ((project-venv-path (concat (projectile-project-root) "venv/")))
      (when (projectile--directory-p project-venv-path)
        (pyvenv-activate project-venv-path)
        (pyvenv-mode))))

  (use-package python-mode
    :hook (python-mode . lsp-deferred)
    :hook (python-mode . jd/python-mode-setup)
    :config
    (add-to-list 'auto-mode-alist '("\\.py\\'" . python-mode)))

  (use-package pyvenv
    :after python-mode)

  (use-package django-mode
    :config
    ;; Remove all django-mode objects from auto-mode-alist
    (while (rassq 'django-mode auto-mode-alist)
      (let ((django-mode-object (rassq 'django-mode auto-mode-alist)))
        (setq auto-mode-alist (delete django-mode-object auto-mode-alist)))))

#+end_src

*** TypeScript

#+begin_src emacs-lisp

  (use-package typescript-mode
    :mode ("\\.ts\\'")
    :config
    (setq typescript-indent-level 2))

  (defun jd/activate-tide-mode ()
    (when (and (stringp buffer-file-name)
               (string-match "\\.[tj]sx?\\'" buffer-file-name))
      (tide-setup)
      (tide-hl-identifier-mode)))

  (use-package tide
    :ensure t
    :after (typescript-mode company web-mode))

  (use-package flycheck
    :ensure t
    :hook ((after-init . global-flycheck-mode)))

  (use-package web-mode
    :ensure t
    :hook ((web-mode . jd/activate-tide-mode))
    :mode
    ("\\.ejs\\'" "\\.hbs\\'" "\\.html\\'" "\\.php\\'" "\\.[jt]sx?\\'")
    :config
    (setq web-mode-content-types-alist '(("jsx" . "\\.[jt]sx?\\'")))
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-script-padding 2)
    (setq web-mode-block-padding 2)
    (setq web-mode-style-padding 2)
    (setq web-mode-enable-auto-pairing t)
    (setq web-mode-enable-auto-closing t)
    (setq web-mode-enable-current-element-highlight t))

#+end_src

*** Yaml

#+begin_src emacs-lisp

  (use-package yaml-mode)
  
#+end_src

*** Docker

#+begin_src emacs-lisp

  (use-package docker)

#+end_src

**** Keybinds

#+begin_src emacs-lisp

  (jd/leader-key-def
    "d" '(:ignore t :which-key "Docker")
    "dc" '(docker-containers :which-key "Docker containers")
    "dd" '(docker :which-key "Docker"))

#+end_src

** Dap mode

#+begin_src emacs-lisp

  (use-package dap-mode
    ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;; :custom
    ;; (lsp-enable-dap-auto-configure nil)
    ;; :config
    ;; (dap-ui-mode 1)
    :commands dap-debug
    :config
    ;; Set up Node debugging
    (require 'dap-node)
    (dap-node-setup) ;; Automatically installs Node debug adapter if needed

    ;; Bind `C-c l d` to `dap-hydra` for easy access
    (general-define-key
      :keymaps 'lsp-mode-map
      :prefix lsp-keymap-prefix
      "d" '(dap-hydra t :wk "debugger")))

#+end_src

** Company

#+begin_src emacs-lisp

      (use-package company
        :after lsp-mode
        :hook (lsp-mode . company-mode)
        :bind (:map company-active-map
               ("<tab>" . company-complete-selection))
              (:map lsp-mode-map
               ("<tab>" . company-indent-or-complete-common))
        :custom
        (company-minimum-prefix-length 1)
        (company-idle-delay 0.0)
        :config
        (global-company-mode))

      (use-package company-box
        :hook (company-mode . company-box-mode))
  
#+end_src

** Projectile

#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :init
    (when (file-directory-p "~/Documents/code")
      (setq projectile-project-search-path '("~/Documents/code/")))
    :custom ((projectile-Completion-system 'ivy))
    :config
    (setq projectile-switch-project-action #'projectile-dired)
    (projectile-mode))

#+end_src

*** Keybinds

#+begin_src emacs-lisp

  (jd/leader-key-def
    "p" '(projectile-command-map :which-key "Project")
    "p <ESC>" '()
    "SPC" '(projectile-find-file :which-key "Find file in project"))

#+end_src

