Emacs.org
** Neotree

#+begin_src emacs-lisp

  (defun jd/neotree-project-dir ()
    "Open NeoTree using the git root."
    (interactive)
    (let ((project-dir (projectile-project-root))
          (file-name (buffer-file-name)))
      (neotree-toggle)
      (if project-dir
          (if (neo-global--window-exists-p)
              (progn
                (neotree-dir project-dir)
                (neotree-find file-name)))
        (message "Could not find git project root."))))

  (use-package neotree
    :init
    (setq neo-theme 'icons)
    :config

    (evil-define-key 'normal neotree-mode-map (kbd "TAB") 'neotree-enter)
    (evil-define-key 'normal neotree-mode-map (kbd "C-RET") 'neotree-quick-look)
    (evil-define-key 'normal neotree-mode-map (kbd "q") 'neotree-hide)
    (evil-define-key 'normal neotree-mode-map (kbd "RET") 'neotree-enter)
    (evil-define-key 'normal neotree-mode-map (kbd "g") 'neotree-refresh)
    (evil-define-key 'normal neotree-mode-map (kbd "A") 'neotree-stretch-toggle)
    (evil-define-key 'normal neotree-mode-map (kbd "H") 'neotree-hidden-file-toggle))

#+end_src

*** Keybinds

#+begin_src emacs-lisp

  (jd/leader-key-def
    "op" '(jd/neotree-project-dir :which-key "Open neotree"))

#+end_src

** Magit

#+begin_src emacs-lisp

  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

*** Keybinds

#+begin_src emacs-lisp

  (jd/leader-key-def
    "g" '(:ignore t :which-key "Git")
    "gg" '(magit-status-here :which-key "Magit status"))

#+end_src

* Apps
** Vterm

#+begin_src emacs-lisp

  (defun jd/open-new-vterm (&optional jd/vterm-buffer-name)
    (interactive)
    (let ((buffer-name (generate-new-buffer-name vterm-buffer-name)))
      (when jd/vterm-buffer-name
        (setq buffer-name jd/vterm-buffer-name))
      (switch-to-buffer buffer-name)
      (vterm-mode)))


  (use-package vterm
    :config
    (setq vterm-buffer-name "vterm")
    (evil-set-initial-state 'vterm-mode 'emacs))

#+end_src

*** Keybinds

#+begin_src emacs-lisp

  (jd/leader-key-def
    "ot" '(jd/open-new-vterm :which-key "Open terminal in current window"))
 
#+end_src

** Dired

#+begin_src emacs-lisp

    (use-package all-the-icons-dired
      :hook (dired-mode . all-the-icons-dired-mode))

    (use-package dired-ranger)

    (use-package dired-single)

    (use-package dired
      :ensure nil
      :commands (dired dired-jump)
      :custom ((dired-listing-switches "-agho --group-directories-first"))
      :config
      (evil-collection-define-key 'normal 'dired-mode-map
        "y" 'dired-ranger-copy
        "p" 'dired-ranger-paste
        "X" 'dired-ranger-move
        "h" 'dired-up-directory
        "t" 'dired-create-empty-file
        "T" 'dired-toggle-marks
        "l" 'dired-single-buffer)
      (setq dired-kill-when-opening-new-dired-buffer t)
      (evil-define-key 'normal dired-mode-map (kbd "q") 'kill-current-buffer))


#+end_src

** EMMS

#+begin_src emacs-lisp

      (use-package emms
        :config
        (require 'emms-setup)
        (emms-all)
        (emms-standard)
        (emms-default-players)
        (emms-mode-line-disable)
                                              ; (setq emms-info-functions '(emms-info-tinytag))
        (setq emms-browser-covers 'emms-browser-cache-thumbnail-async)
        (setq emms-lyrics-dir "~/Documents/music/lyrics")
        (emms-add-directory-tree "~/Documents/music/"))

#+end_src

** PDF Tools

#+begin_src emacs-lisp

  (use-package pdf-tools)

#+end_src

** Mu4e
- Load my [[./Mu4e.org][mu4e]] config

#+begin_src emacs-lisp
  (require 'jd-mu4e)
#+end_src

** RSS

#+begin_src emacs-lisp

  (use-package elfeed
    :config
    (setq elfeed-feeds
          '("https://www.reddit.com/r/emacs.rss")))

#+end_src

* Runtime Performance

#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 2 1000 1000))
#+end_src
